adamkondraciuk/nrfx/mdk/gcc_startup_nrf54h20_engb_secure.S
    .weak   SysTick_Handler
    .type   SysTick_Handler, %function
SysTick_Handler:
    b       .
    .size   SysTick_Handler, . - SysTick_Handler


/* IRQ Handlers */

    .globl  Default_Handler
    .type   Default_Handler, %function
Default_Handler:
    b       .
    .size   Default_Handler, . - Default_Handler

    .macro  IRQ handler
    .weak   \handler
    .set    \handler, Default_Handler
    .endm

    IRQ  SPU000_IRQHandler
    IRQ  MPC000_IRQHandler
    IRQ  MVDMA_IRQHandler
    IRQ  CRACEN_IRQHandler
    IRQ  SPU010_IRQHandler
    IRQ  WDT010_IRQHandler
    IRQ  WDT011_IRQHandler
    IRQ  TAMPC_IRQHandler
    IRQ  IPCT_0_IRQHandler
    IRQ  IPCT_1_IRQHandler
    IRQ  SWI0_IRQHandler
    IRQ  SWI1_IRQHandler
    IRQ  SWI2_IRQHandler
    IRQ  SWI3_IRQHandler
    IRQ  SWI4_IRQHandler
    IRQ  SWI5_IRQHandler
    IRQ  SWI6_IRQHandler
    IRQ  SWI7_IRQHandler
    IRQ  BELLBOARD_0_IRQHandler
    IRQ  BELLBOARD_1_IRQHandler
    IRQ  BELLBOARD_2_IRQHandler
    IRQ  BELLBOARD_3_IRQHandler
    IRQ  GPIOTE130_0_IRQHandler
    IRQ  GPIOTE130_1_IRQHandler
    IRQ  GRTC_0_IRQHandler
    IRQ  GRTC_1_IRQHandler
    IRQ  GRTC_2_IRQHandler
    IRQ  MPC200_IRQHandler
    IRQ  SPU200_SPU210_IRQHandler
    IRQ  CTRLAP_IRQHandler
    IRQ  TBM_IRQHandler
    IRQ  SPU110_IRQHandler
    IRQ  MPC110_IRQHandler
    IRQ  USBHS_IRQHandler
    IRQ  SPU111_IRQHandler
    IRQ  MPC111_IRQHandler
    IRQ  MRAMC110_IRQHandler
    IRQ  MRAMC111_IRQHandler
    IRQ  EXMIF_IRQHandler
    IRQ  SPU120_IRQHandler
    IRQ  MPC120_IRQHandler
    IRQ  OTPC_IRQHandler
    IRQ  VPR120_IRQHandler
    IRQ  SPU121_IRQHandler
    IRQ  IPCT120_0_IRQHandler
    IRQ  I3C120_IRQHandler
    IRQ  VPR121_IRQHandler
    IRQ  CAN120_IRQHandler
    IRQ  MVDMA120_IRQHandler
    IRQ  I3C121_IRQHandler
    IRQ  SPU122_IRQHandler
    IRQ  TIMER120_IRQHandler
    IRQ  TIMER121_IRQHandler
    IRQ  PWM120_IRQHandler
    IRQ  SPIS120_IRQHandler
    IRQ  SPIM120_UARTE120_IRQHandler
    IRQ  SPIM121_IRQHandler
    IRQ  SPU130_IRQHandler
    IRQ  MPC130_IRQHandler
    IRQ  VPR130_IRQHandler
    IRQ  SPU131_IRQHandler
    IRQ  IPCT130_0_IRQHandler
    IRQ  RTC130_IRQHandler
    IRQ  RTC131_IRQHandler
    IRQ  WDT131_IRQHandler
    IRQ  WDT132_IRQHandler
    IRQ  EGU130_IRQHandler
    IRQ  RESETHUB_IRQHandler
    IRQ  SPU132_IRQHandler
    IRQ  SAADC_IRQHandler
    IRQ  COMP_LPCOMP_IRQHandler
    IRQ  TEMP_IRQHandler
    IRQ  NFCT_IRQHandler
    IRQ  SPU133_IRQHandler
    IRQ  TDM130_IRQHandler
    IRQ  PDM_IRQHandler
    IRQ  QDEC130_IRQHandler
    IRQ  QDEC131_IRQHandler
    IRQ  TDM131_IRQHandler
    IRQ  SPU134_IRQHandler
    IRQ  TIMER130_IRQHandler
    IRQ  TIMER131_IRQHandler
    IRQ  PWM130_IRQHandler
    IRQ  SERIAL0_IRQHandler
    IRQ  SERIAL1_IRQHandler
    IRQ  SPU135_IRQHandler
    IRQ  TIMER132_IRQHandler
    IRQ  TIMER133_IRQHandler
    IRQ  PWM131_IRQHandler
    IRQ  SERIAL2_IRQHandler
    IRQ  SERIAL3_IRQHandler
    IRQ  SPU136_IRQHandler
    IRQ  TIMER134_IRQHandler
    IRQ  TIMER135_IRQHandler
    IRQ  PWM132_IRQHandler
    IRQ  SERIAL4_IRQHandler
    IRQ  SERIAL5_IRQHandler
    IRQ  SPU137_IRQHandler
    IRQ  TIMER136_IRQHandler
    IRQ  TIMER137_IRQHandler
    IRQ  PWM133_IRQHandler
    IRQ  SERIAL6_IRQHandler
    IRQ  SERIAL7_IRQHandler

  .end
